In [1]:
import numpy as np
import pandas as pd

### 1. Find out how many males and females participated in the test.

In [2]:
data=pd.read_csv(r'D:\DataScience\StudentsPerformance.csv')

In [3]:
data.head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33
5,female,group B,high school,free/reduced,completed,23,44,36
6,female,group B,some high school,free/reduced,none,24,38,27
7,female,group D,associate's degree,free/reduced,none,26,31,38
8,female,group D,some high school,free/reduced,none,19,34,32
9,female,group C,high school,standard,none,29,29,30

In [4]:
data['gender'].value_counts()

female    518
male      482
Name: gender, dtype: int64

### 2. What do you think about the students' parental level of education?

In [5]:
data['parental level of education'].describe()

count             1000
unique               6
top       some college
freq               226
Name: parental level of education, dtype: object

In [6]:
data['parental level of education'].value_counts()

some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: parental level of education, dtype: int64

### 3. Who scores the most on average for math, reading and writing based on
● Gender
● Test preparation course

In [7]:
Gender_mean=data.groupby('gender').mean()
Gender_mean

        math score  reading score  writing score
gender
female   63.376448      72.590734      72.467181
male     68.821577      65.545643      63.446058

In [10]:
course_mean=data.groupby('test preparation course').mean()
course_mean

                         math score  reading score  writing score
test preparation course
completed                  69.96648      74.175978      74.684358
none                       63.78972      66.417445      64.457944

### 4. What do you think about the scoring variation for math, reading and writing
based on
● Gender
● Test preparation course

In [8]:
Gender_variance=data.groupby('gender').var()
Gender_variance

        math score  reading score  writing score
gender
female  256.958593     207.677438     220.369327
male    211.889097     200.211010     202.413924

In [12]:
course_variance=data.groupby('test preparation course').var()
course_variance

                         math score  reading score  writing score
test preparation course
completed                210.884027     183.265864     175.202612
none                     246.668662     213.419851     226.251739

### 5. The management needs your help to give bonus points to the top 25% of
students based on their math score, so how will you help the management
to achieve this.

In [9]:
data['math score'].sort_values(ascending=False).head(250)

999    100
996    100
515    100
517    100
516    100
      ...
856     77
855     77
854     77
853     77
852     77
Name: math score, Length: 250, dtype: int64